---
kind: other
id: Methods.T:Autodesk.Revit.DB.IOnLocalLinkSharedCoordinatesSavedCallback
source: html/a4d6caee-9d06-179d-02f5-07fbd398f5d7.htm
---
# IOnLocalLinkSharedCoordinatesSavedCallback Methods

Revit will call this method whenever shared coordinates
 changes are saved to a linked document provided by an
 IExternalResourceServer. This call is a notification
 to the server provider that one of their Revit or DWG
 links has changed locally, and they should upload the
 new version back to their server.